In [1]:
import pandas as pd
import sqlite3

In [2]:
connection = sqlite3.connect("data/chinook.db")
crsr = connection.cursor()

In [13]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [8]:
query = '''
SELECT c.FirstName,c.LastName,c.Country
FROM customers as c
WHERE c.Country  = "Brazil" 
'''

df = sql_query(query)
df

   FirstName   LastName Country
0       Luís  Gonçalves  Brazil
1    Eduardo    Martins  Brazil
2  Alexandre      Rocha  Brazil
3    Roberto    Almeida  Brazil
4   Fernanda      Ramos  Brazil

In [9]:
query = '''
SELECT e.FirstName,e.LastName,e.Title
FROM employees as e
WHERE e.Title  = "Sales Support Agent" 
'''

df = sql_query(query)
df

  FirstName LastName                Title
0      Jane  Peacock  Sales Support Agent
1  Margaret     Park  Sales Support Agent
2     Steve  Johnson  Sales Support Agent

In [10]:
query = '''
SELECT t.Name,t.Composer
FROM tracks as t
WHERE t.Composer  = "AC/DC" 
'''

df = sql_query(query)
df

                           Name Composer
0                       Go Down    AC/DC
1                   Dog Eat Dog    AC/DC
2             Let There Be Rock    AC/DC
3                Bad Boy Boogie    AC/DC
4                 Problem Child    AC/DC
5                      Overdose    AC/DC
6  Hell Ain't A Bad Place To Be    AC/DC
7             Whole Lotta Rosie    AC/DC

In [16]:
query = '''
SELECT c.FirstName,c.LastName,c.Country,c.CustomerId
FROM customers as c
WHERE c.Country  != "USA" 
'''

df = sql_query(query)
df

    FirstName      LastName         Country  CustomerId
0        Luís     Gonçalves          Brazil           1
1      Leonie        Köhler         Germany           2
2    François      Tremblay          Canada           3
3       Bjørn        Hansen          Norway           4
4   František   Wichterlová  Czech Republic           5
5      Helena          Holý  Czech Republic           6
6      Astrid        Gruber         Austria           7
7        Daan       Peeters         Belgium           8
8        Kara       Nielsen         Denmark           9
9     Eduardo       Martins          Brazil          10
10  Alexandre         Rocha          Brazil          11
11    Roberto       Almeida          Brazil          12
12   Fernanda         Ramos          Brazil          13
13       Mark       Philips          Canada          14
14   Jennifer      Peterson          Canada          15
15     Robert         Brown          Canada          29
16     Edward       Francis          Canada          30
17     Martha          Silk          Canada          31
18      Aaron      Mitchell          Canada          32
19      Ellie      Sullivan          Canada          33
20       João     Fernandes        Portugal          34
21   Madalena       Sampaio        Portugal          35
22     Hannah     Schneider         Germany          36
23       Fynn    Zimmermann         Germany          37
24     Niklas      Schröder         Germany          38
25    Camille       Bernard          France          39
26  Dominique      Lefebvre          France          40
27       Marc        Dubois          France          41
28      Wyatt        Girard          France          42
29   Isabelle       Mercier          France          43
30      Terhi    Hämäläinen         Finland          44
31   Ladislav        Kovács         Hungary          45
32       Hugh      O'Reilly         Ireland          46
33      Lucas       Mancini           Italy          47
34   Johannes  Van der Berg     Netherlands          48
35  Stanisław        Wójcik          Poland          49
36    Enrique         Muñoz           Spain          50
37     Joakim     Johansson          Sweden          51
38       Emma         Jones  United Kingdom          52
39       Phil        Hughes  United Kingdom          53
40      Steve        Murray  United Kingdom          54
41       Mark        Taylor       Australia          55
42      Diego     Gutiérrez       Argentina          56
43       Luis         Rojas           Chile          57
44      Manoj        Pareek           India          58
45       Puja    Srivastava           India          59

In [31]:
query = '''
SELECT e.FirstName,e.LastName,e.Title,e.City,e.State,e.Country,e.Email
FROM employees as e
WHERE e.Title  = "Sales Support Agent" 
'''

df = sql_query(query)
df

,FirstName,LastName,Title,City,State,Country,Email
0,Jane,Peacock,Sales Support Agent,Calgary,AB,Canada,jane@chinookcorp.com
1,Margaret,Park,Sales Support Agent,Calgary,AB,Canada,margaret@chinookcorp.com
2,Steve,Johnson,Sales Support Agent,Calgary,AB,Canada,steve@chinookcorp.com

In [34]:
query = '''
SELECT DISTINCT BillingCountry
FROM invoices
'''

df = sql_query(query)
df

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

In [43]:
query = '''
SELECT DISTINCT State, COUNT (customers.CustomerId) as TOT
FROM customers
WHERE Country = "USA"
GROUP BY State 
ORDER BY TOT DESC
'''

df = sql_query(query)
df

   State  TOT
0     CA    3
1     WI    1
2     WA    1
3     UT    1
4     TX    1
5     NY    1
6     NV    1
7     MA    1
8     IL    1
9     FL    1
10    AZ    1

In [49]:
query = '''
SELECT i.invoiceId,COUNT (it.Quantity) as Cantidad_Total FROM invoice_items as it
INNER JOIN invoices as i
ON it.InvoiceId = i.InvoiceId
WHERE i.InvoiceId = 37
'''

df = sql_query(query)
df

   InvoiceId  Cantidad_Total
0         37               4